{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 128,
  "id2label": {
    "0": "Cana",
    "1": "Cereja",
    "2": "Passa",
    "3": "Verde"
  },
  "image_size": 64,
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "label2id": {
    "Cana": 0,
    "Cereja": 1,
    "Passa": 2,
    "Verde": 3
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 4,
  "num_channels": 3,
  "num_hidden_layers": 7,
  "patch_size": 4,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.46.3"
}
